# Rebar Create Free Form(Document, Rebar Bar Type, Element, IList Curve Loop , Rebar Free Form Validation Result ) Method

Source: https://www.revitapidocs.com/2026/38767c5e-0196-3359-69db-19d728873b19.htm

---

| Rebar Create Free Form(Document, Rebar Bar Type, Element, IList Curve Loop , Rebar Free Form Validation Result ) Method |
| --- |

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.CreateFreeForm(Document doc, RebarBarType barType, Element host, IList(CurveLoop) curves, RebarStyle style) instead.")]
public static Rebar CreateFreeForm(
	Document doc,
	RebarBarType barType,
	Element host,
	IList<CurveLoop> curves,
	out RebarFreeFormValidationResult error
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.CreateFreeForm(Document doc, RebarBarType barType, Element host, IList(CurveLoop) curves, RebarStyle style) instead.")>
Public Shared Function CreateFreeForm (
	doc As Document,
	barType As RebarBarType,
	host As Element,
	curves As IList(Of CurveLoop),
	<OutAttribute> ByRef error As RebarFreeFormValidationResult
) As Rebar
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.CreateFreeForm(Document doc, RebarBarType barType, Element host, IList(CurveLoop) curves, RebarStyle style) instead.")]
static Rebar^ CreateFreeForm(
	Document^ doc,
	RebarBarType^ barType,
	Element^ host,
	IList<CurveLoop^>^ curves,
	[OutAttribute] RebarFreeFormValidationResult% error
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.CreateFreeForm(Document doc, RebarBarType barType, Element host, IList(CurveLoop) curves, RebarStyle style) instead.")>]
static member CreateFreeForm :
        doc : Document *
        barType : RebarBarType *
        host : Element *
        curves : IList<CurveLoop> *
        error : RebarFreeFormValidationResult byref -> Rebar
```

#### Parameters

doc Document
barType RebarBarType
host Element
curves IList CurveLoop
error RebarFreeFormValidationResult

#### Return Value

Rebar See Also

#### Reference

Rebar Class CreateFreeForm Overload Autodesk.Revit.DB.Structure Namespace